{"id":107,"label":"true","text":"Opinion Modal Trigger Voters’ top concerns are the stagnant economy and the threat of terrorism, but you wouldn’t know it from Hillary Clinton’s TV ads or campaign speeches. She’s trying to twist the presidential race into a referendum on political correctness. Too embarrassed to run on her party’s economic record or her failed stint as secretary of state, she’s positioning herself as top cop of the speech police. For example, Hillary is running an ad depicting pre-teen girls looking self-consciously in the mirror, agonizing over their bodies. Sometimes such young girls’ worries turn into deadly eating disorders, ultimately killing 10 percent of those affected. Clinton cynically exploits the pain and fear felt by thousands of families. Her ad uses a voiceover of Trump saying things like “she ate like a pig” and “does she have a fat ass?” Parents struggling with their child’s eating disorder run to one doctor after another frantically seeking answers. The causes are complex and still not entirely known — but no one believes the cause is Donald Trump. Some experts blame Hollywood’s glorification of skinny women for at least contributing to the rash of eating disorders and young girls’ body-image struggles. Instead of trying to muzzle Trump and other men, why isn’t Hillary calling out her big supporters in the entertainment industry? The same question applies to Hillary’s double standard in bashing Trump for lewdness but celebrating it in popular music. Clinton’s latest super PAC ads condemn Trump’s bawdy 2005 remarks on a bus with show-biz journalist Billy Bush. Trump bragged to his buddy, “I moved on her like a bitch.” Clinton claims to have been outraged when she heard it, calling it “horrific.” Manhattan Institute scholar Heather Mac Donald chuckles at Clinton’s hypocritical “sudden onset of Victorian vapors.” After all, Clinton has no problem with the salacious lyrics of her pal and supporter Beyoncé. Even when Beyoncé sings: “I came to slay bitch . . . when he f–k me good I take his ass to Red Lobster.” Clinton says, “I want to be as good a president as Beyoncé is a performer.” Trump can’t catch a break with Clinton, even when he’s trying to do the right thing. Another Clinton ad attacks Trump reaching out to inner-city African-Americans with promises of more jobs and school choice. Reminding minority voters that Democratic politicians have failed to improve their economic opportunities, Trump asks for their vote, saying: “What the hell do you have to lose?” Clinton’s ad says: “Everything.” It follows her ad featuring Ku Klux Klan members praising Trump. It’s McCarthyite guilt by association. Trump has no connection to the group. What’s Trump actually guilty of? Poaching on Hillary’s turf. Worse than tarring Trump, she’s labeling cops, teachers and millions of other Americans racists. Whenever she talks to black audiences, she stokes racial resentment. She told the NAACP that whites “need to recognize our privilege and practice humility.” All whites, she claims, have “implicit bias,” and she wants bias training for police and other professions. Implicit bias — you’re told you have it even if you don’t realize it, no matter how colorblind you try to be, and denying your bias just proves it. Implicit bias is PC drivel. There’s no solid data to support it, cautions social scientists Philip Tetlock of UPenn and Gregory Mitchell of the University of Virginia and experts from New York University and the University of Connecticut. But if Clinton becomes president, we’ll all be undergoing re-education at school or work to cure our “implicit bias.” To see what President Hillary’s America would be like, look at most college campuses today. Few on campus dare to question Black Lives Matter, militant multiculturalism and “safe spaces” to spare students from challenging ideas. Hillary’s dictating how Americans talk about race, sex, even body shapes. Trump calls it like he sees it. He doesn’t stick to the well-rehearsed rhetoric of a career politician. But his supporters are sick and tired of political correctness. He’s not running for saint. He’s running to get the job done, something Hillary Clinton has already proven she can’t do. Betsy McCaughey is a senior fellow at the London Center for Policy Research."}
{"id":54,"label":"false","text":"Brazil’s new Migration Law relaxes criminal penalties for migrants. At a recent protest against this law in São Paulo, Muslim migrants demonstrated their distaste for dissent. Jihad Watch reader Natan sends in this video and writes: Terrorist Attempt at Anti-Migration Law Protest in Brazil. Syrian immigrants throw homemade bombs at peaceful people protesting at Av. Paulista in São Paulo, Brazil. The attack took place on May 2, when the group of protesters was walking. The attack was recorded by one of the protesters. In the video it is possible to see when the Muslims ignited the artifact and launched against the civilians. Police arrested the attackers, the crime was registered at a local police station."}
{"id":206,"label":"false","text":"Michael Douglas has jumped ahead of allegations he masturbated in front of a former employee, insisting he’s not about to sit back and become the villain of a harassment story. The Basic Instinct star claims staff at both The Hollywood Reporter and Variety have reached out for feedback concerning accusations he pleasured himself in front of an employee three decades ago, and he’s keen to get ahead of the story, before he joins the likes of Harvey Weinstein, Louis C.K., Jeremy Piven, and Brett Ratner, among others, who have been accused of sexual misconduct. Douglas has turned to movie news website Deadline to set the story straight, stating, “I felt the need to get ahead of this.” Revealing that The Hollywood Reporter contacted him via his attorney regarding the woman’s claims that he used “colourful language” in front of her, “spoke raunchily, or dirtily with friends of mine in private conversations on the phone”. The woman’s third claim was that the actor masturbated in front of her, to which Douglas responds, “I remembered this woman: sophisticated intelligent, good sense of humour, a novelist, who has written books and published novels and was an active feminist, and proud of it. My head was reeling. I just couldn’t put this together.” Insisting she “could have excused herself” if she was offended by the language he used in private conversations, Douglas adds the allegations he blackballed the unnamed women are “completely untrue”. He adds that the claims he masturbated in front of her are “a complete lie, fabrication”. According to the actor, the journalist at The Hollywood Reporter agreed to sit on the story over the holidays, but in the New Year the publication got back in touch and said, “‘She’s (accuser) running around, possibly trying to give this story to other people, so we’re going to run with it’. “I said, ‘I don’t think that’s justification, just because you might get scooped, to run a story like this’… I was floored,” he continues. “I didn’t know what to say and I tried to digest it. The accusations are minimal, except of course for the idea of masturbating in front of her. She supposedly had three friends who would back her up, that she had mentioned this to… “How am I, in a 50 year career in this industry, dealing with an employee 33 years ago who perhaps is disgruntled that I let her go, even though I have never heard from her in 32 years. And a legitimate trade publication is going to try and print this story? There is no corroboration, just that they found out somebody else might run the story.” Douglas calls the whole saga “extremely painful”, adding, “I pride myself on my reputation in this business… I’m bewildered why, after 32 years, this is coming out, now. “The part that hurt the worst is having to share something like this to your wife and your children. My kids are really upset, have to go to school worrying this is going to be in some article about me, being a sexual harasser. They’re scared and very uncomfortable.” Douglas also states this isn’t “the New Year I had anticipated”, adding he’s worried the drama may affect upcoming work he has booked. “I’m fearful,” he says. “I have jobs going with studios who all seem to be supportive at this time. I’m hurt, really hurt and offended and I wonder if people realize when you do something like this, it hurts a lot more than just one person.” Play Video Play Loaded: 0% Progress: 0% Remaining Time -0:00 This is a modal window. Foreground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque Background --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent Window --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps Defaults Done ATLANTA — Desmond Marrow rejoiced when the officer he said choked him during an arrest was fired soon after a video of the encounter went viral. But now his lawyers say police and elected…"}
{"id":433,"label":"true","text":"Once this Harvey Weinstein debacle is completely finished, Hollywood will be a haven of racial, gender and financial equality. Ha, ha — right. The ongoing saga of Harvey Weinstein’s downfall continues with news about the former mogul possibly being stripped of his Oscar. As police in New York and London investigate the many complaints against him of sexual assault, rumours persist that Weinstein will be booted from the Producers Guild of America. Meanwhile, the name of The Weinstein Company will be changed and Weinstein’s name will be taken off future projects. Even the man’s political contributions are being returned or handed over to women’s charities. Other industry bigwigs and political leaders are being pilloried for not condemning Weinstein fast enough. His wife has left, his adult daughter feared he was suicidal, and people are lining up to savage the guy. Soon, he’ll be drawn and quartered in a public place, no doubt. On the business side, it’s been reported that The Weinstein Company is a shambles, with agents and talent trying to get themselves and their projects away from the bad smell, and upcoming films such as The Current War and The Upside in release limbo. The Financial Times says that Goldman Sachs is “exploring options” for its small stake in The Weinstein Company — and really, people, if the Goldman Sachs is taking the moral high ground, consider yourself toast. So why — just out of interest — is a 30-year problem coming to light now? Did we reach a tipping point? Was Mr. Weinstein’s career in decline? Is there a power struggle nobody knows about in the offices of the company? Have we reached some sort of landmark in the ongoing saga of sexual impropriety and the war between men and women? Doubtful. Still, it’s interesting that several formerly untouchable guys have been taken down recently, including Bill Cosby, Bill O’Reilly, Roger Ailes and Donald Trump, that last dude being just a bit tougher to get rid of than the others. Why is the Weinstein case different? It’s not as if Harvey Weinstein varies much from all the other handsy creeps in his business — oohhh, the names we’d insert here — and casting couch stories have plagued the industry since Florence Lawrence first fluttered her eyelashes circa 1906. Some of the more interesting fallout from the Weinstein case involves the support weasels — every Weinstein staffer who knew things were rotten is under a cloud, and so is every agent, manager, casting agent, publicist or assistant who knowingly sent some poor girl to talk to Weinstein in a hotel room. And how about the lawyers who handled the hush money all those years? Be interesting to see who gets tackled next. Since Weinstein is no doubt just a difference in degree, not in kind, it’s tough to say if this uproar will change anything on a permanent basis in his industry. Still, it would be interesting to know why Hollywood is such a sleazy place. The movie industry really is a cesspool of sexual harassment and bullying; hard to know how so many people go to work every day in such an atmosphere of fear and loathing. Many an analyst has decreed that vast amounts of money and power will do it every time, and maybe that’s true — look at Dominique Strauss-Kahn, or Silvio Berlusconi, or even l’il old home-grown Jian Ghomeshi. People will risk a lot to get anywhere near rich and famous, and an industry that allows ordinary people — capable of memorizing dialogue and playing make-believe — to be treated like gods is an industry in which every sort of predatory behaviour will no doubt thrive. How to explain the sexually predatory behaviour of men in every other industry is a bit more of a mystery. Play Video Play Loaded: 0% Progress: 0% Remaining Time -0:00 This is a modal window. Foreground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque Background --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent Window --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps Defaults Done Riley Fleming and Wes Heffernan have been going back and forth all year, so why wouldn’t you expect them to do the same thing in the PGA of Alberta Championship? “We’ve been so close, it’s…"}
{"id":380,"label":"false","text":"Geopolitical tensions are mounting after state-run North Korean news media released footage of what appears to be the successful test of a devastating missile dropkick. In newly released footage, North Korean President Kim Jong-Un is seen celebrating as missile dropkick collides feet-first with an ocean target, causing a huge “bump.” The missile dropkick was reportedly launched from the country’s Technical Operations Pad for Thermonuclear and Underwater Reconnaissance Networks of Ballistics Used for Catastrophic Kinetic Launching Exercises, or T.O.P. T.U.R.N.B.U.C.K.L.E. International weaponry experts have long known that North Korea is capable of launching a Powerbomb — perhaps even an Exploder Suplex — but the possibility that the country now has a missile dropkick in its arsenal has caused alarm worldwide and throughout the WWE Universe. U.S. President and WWE Hall of Famer Donald Trump has insisted he has “zero tolerance” for North Korea’s missile dropkick tests and will, if necessary, send Bobby Lashley over to “take care of them” before Trump himself shaves Kim Jong-Un’s head."}
{"id":52,"label":"true","text":"Hillary Clinton’s niece is turning her back on her “selfish” aunt — to endorse Donald Trump for president. “I support Donald Trump 100 percent,” Macy Smit, the daughter of Bill Clinton’s half-brother Roger Clinton, declared to RadarOnline. “I have been a Democrat my entire life, but Trump is what we need right now — somebody who is going to stand up for us. I think at this point Hillary just wants it for the history books — to be the first woman president for selfish reasons,” the Tampa hairstylist continued. Smit, 25, admitted she’s never met Hillary Clinton, and said that side of the family doesn’t think much of her. “Something tells me the Clinton side looks at me and my mother as not good enough, but we’re hard-working,” Smit told the gossip site. Roger Clinton was a deadbeat dad who dumped Smit’s mom, Martha Spivey, shortly after she became pregnant with his child, according to RadarOnline. “The Clintons are all talk!” Spivey, 50, told the site. “Hillary says she’s all about family, but she’s got a niece she’s never met and never acknowledged. The Clintons have never helped us out.” Hillary’s lost the trust of even more voters with her inconsistencies:"}
{"id":305,"label":"false","text":"Chris Brown, 27, was stopped from a potential physical altercation by police at a charity basketball game on the anniversary of 9\/11 (video below). The singer got into such a heated argument with someone in the stands that the cops were called in to intervene before the situation escalated any further. The incident occurred at the Power 106 Celebrity Basketball Game at USC, reports TMZ. Video footage shows Brown becoming visibly upset as he leans over the bench seats to argue with a spectator. The music was too loud to make out exactly what words were exchanged, but USC cops can be heard saying, “ I don’t care who’s here, get it straight.” Brown walked away twice but came back moments later each time to continue the quarrel, according to the Daily Mail. At one point, the R&amp;B singer was encircled by cops as he tried to explain the situation. Brown has become the latest high-profile star to join Colin Kaepernick’s national anthem protest against police brutality and racial inequality in America. Before the basketball game, Brown did not observe the anthem. Instead, Brown laughed with friends as he sat during the song’s performance. The anthem was sung by R&amp;B singer Tank, who asked the audience to stand “in the wake of 9\/11” and in respect for those who lost their lives in the September 2011 terrorist attacks. However, Brown applauded Tank at the end for his effort. Brown was arrested just last week after a standoff with police officers at his Tarzana home over allegations he threatened a woman with a gun. During the event, Brown posted videos on social media in which he denounced the police and said he was being unfairly demonized."}
{"id":99,"label":"false","text":"Former George W. Bush communications director Nicolle Wallace reported Tuesday multiple senior Republican officials have told her that to expect that special counsel Robert Mueller is pursuing an obstruction of justice case against President Donald Trump. “Three Republicans with close ties to the Trump White House, all veterans from previous Republican administrations, tell me that it’s clear from their conversations and contacts with the president’s inner circle that Bob Mueller is trying to build an obstruction of justice case,” MSNBC host of “Deadline: White House” reported Tuesday. “One of them going even farther and saying that the White House is now flying blind and doesn’t know who else might already be cooperating with Mueller’s team,” Wallace explained. That was not the only major news Wallace broke in the first minutes of her show. Wallace also introduced former U.S. Attorney Chuck Rosenberg, who worked on the staff of both Robert Mueller and James Comey of the FBI. “Would you surmise that Donald Trump’s taxes are something that Bob Mueller either has or will seek to obtain?” Wallace asked. “I would, Nicolle, and here’s why. I was a federal prosecutor for a long time and a white collar prosecutor, at the beginning of any case what you need are leads, how do you get those? The first thing you do, you get credit reports and you get tax returns,” Rosenberg explained. “I don’t know that they have the tax returns, but I know what white collar tax attorneys do, they get tax returns,” Rosenberg noted."}
{"id":335,"label":"false","text":"Deception can destroy confidence. Pamela Myer, the author of “Liespotting: Proven Techniques to Detect Deception” has made a career developing interview techniques and identifying verbal and non-verbal ques a person trying to lie to you might exhibit. Follow TI: On Facebook Follow Business Insider Australia on Facebook, Twitter, LinkedIn, and Instagram."}